/////////////////////////////////////ZADACHA//////////////////////////////////
////типы данных и функции (ф-я принимает аргумент и возвращает его тип)////
const getType = (arg) => {
    return typeof arg
}
console.log(getType(null))
//////////////////////////////////////////////////////////////////////////////

/////////////////////////////////////ZADACHA//////////////////////////////////
////циклы, ф-и, типы данных (ф-я принимает массив любых эл-тов и возвр новый//
////массив, содержащий только строки из исходного массива)////////////////////

const filterStrings = (arr) => {
    
}
console.log(filterStrings([1, 'text', true, 'bimbambombom']))

