/////////////////////////////////////ZADACHA//////////////////////////////////
////!!!типы данных и функции!!! (ф-я принимает аргумент и возвращает его тип)////
const getType = (arg) => {
    // return Array.isArray(arg)
    if (arg === null){
        return null
    } else if (Array.isArray(arg)){
        return 'massive'
    }else {
        return typeof(arg)
    }
    
}
console.log(getType(55))
//////////////////////////////////////////////////////////////////////////////

/////////////////////////////////////ZADACHA//////////////////////////////////
////!!!циклы, ф-и, типы данных!!! (ф-я принимает массив любых эл-тов и возвр новый
////массив, содержащий только строки из исходного массива)////////////////////

const filterStrings = (arr) => {
    return arr.filter((element) => typeof element === 'string')
    
}
console.log(filterStrings([1, 'text', true, 'bimbambombom', null, undefined]))

//////////////////////////////////////////////////////////////////////////////


/////////////////////////////////////ZADACHA//////////////////////////////////
////!циклы и ф-и! (написать ф-ю, которая прин число n и выводит в консоль 
////числа от 1 до n включительно. Если число дел на 3, вывод Fizz, если дел на 5
////то вывод Buzz, есл дел на и на 3 и на 5, то FizzBuzz)/////////////////////
//////////////////////////////////////////////////////////////////////////////

const fizzbuzz = (n) => {
     for (let i=0; i<=n; i++){
        if (i % 3 === 0 && i % 5 === 0){
            console.log('FizzBuzz')
        }else if ( i % 3 === 0){
            console.log('Fizz')
        }else if (i % 5 === 0){
            console.log('Buzz');   
        }else (console.log(i))
        

    }}
fizzbuzz(15)